let url_pattern=@"(ftp?|https?|smb?|tftp?|sftp?|nfs?):\/\/(www\.)?[-a-zA-Z0-9@:%._\+~#=]{1,256}\.[a-zA-Z0-9()]{1,6}\b([-a-zA-Z0-9()@:%_\+.~#?&//=]*)";
SecurityEvent
| where EventID==4688
| where CommandLine has_any ('urlcache','verifyctl','split','-f','-"f"',"-'f'")
| extend DownloadUrl=extract(url_pattern, 0, CommandLine)
| where ParentProcessName != @"C:\Windows\System32\CompatTelRunner.exe" and NewProcessName != @"C:\Windows\System32\CompatTelRunner.exe"
| project TimeGenerated, Computer, Account,EventID, Activity, CommandLine, DownloadUrl, ParentProcessName, NewProcessName, NewProcessId, ProcessId