DeviceProcessEvents
| where FileName !in~ ("powershell.exe","pwsh.exe")
| where ProcessCommandLine has_any ("System.Net.WebClient","DownloadString","DownloadFile","Invoke-WebRequest","Invoke-RestMethod")
| where InitiatingProcessFileName != @"tracsrvwrapper.exe" and ProcessCommandLine !contains "169.254.169.254" and ProcessCommandLine !contains "fd00:ec2::254"
| project TimeGenerated, DeviceName, FileName, ProcessCommandLine, InitiatingProcessFileName, InitiatingProcessCommandLine, ProcessId